#### Terraform Plan Output 

```
random_string.dev_id: Refreshing state... [id=84fojm]
random_string.secure_id: Refreshing state... [id=9r3207]
data.archive_file.attacker_zip: Reading...
random_string.public_id: Refreshing state... [id=8p8ia2]
data.archive_file.lambda: Reading...
random_string.legacy_id: Refreshing state... [id=dk8ofy]
random_string.rand_id: Refreshing state... [id=mpn9cb]
data.archive_file.attacker_zip: Read complete after 0s [id=e2074b6c46b0a6e5a1edcf7b0b1a29715f3ae265]
data.archive_file.lambda: Read complete after 0s [id=3bda9e42e6d5b7a022c318f745578ac50ccee9a8]
aws_s3_bucket_server_side_encryption_configuration.dev_enc: Refreshing state... [id=cyb611-insecure-iam-84fojm]
aws_s3_bucket_ownership_controls.dev_log_ownership: Refreshing state... [id=cyb611-insecure-iam-logs-84fojm]
aws_s3_bucket_logging.dev_logging: Refreshing state... [id=cyb611-insecure-iam-84fojm]
aws_s3_bucket_acl.public_acl: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2,public-read]
aws_s3_object.iam_config: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket.dev_logs: Refreshing state... [id=cyb611-insecure-iam-logs-84fojm]
aws_s3_bucket_policy.legacy_ssl_policy: Refreshing state... [id=cyb611-insecure-no-encryption-dk8ofy]
aws_s3_bucket_server_side_encryption_configuration.legacy_enc: Refreshing state... [id=cyb611-insecure-no-encryption-dk8ofy]
aws_s3_bucket_acl.dev_log_acl: Refreshing state... [id=cyb611-insecure-iam-logs-84fojm,log-delivery-write]
aws_s3_bucket.public_logs: Refreshing state... [id=cyb611-insecure-public-rw-logs-8p8ia2]
aws_iam_role.scanner: Refreshing state... [id=S3ScannerRole]
aws_s3_bucket.legacy_data: Refreshing state... [id=cyb611-insecure-no-encryption-dk8ofy]
aws_s3_bucket.dev_bucket: Refreshing state... [id=cyb611-insecure-iam-84fojm]
aws_s3_bucket.main_bucket: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb]
aws_iam_role.attacker_role: Refreshing state... [id=S3RedTeamRole]
aws_s3_bucket.legacy_logs: Refreshing state... [id=cyb611-insecure-no-encryption-logs-dk8ofy]
aws_s3_bucket.trail_bucket: Refreshing state... [id=cyb611-cloudtrail-logs-phish-bits-12345]
aws_s3_bucket.public_assets: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2]
data.aws_caller_identity.current: Reading...
aws_s3_bucket.access_logs: Refreshing state... [id=cyb611-secure-logs-9r3207]
data.aws_caller_identity.current: Read complete after 0s [id=151462990345]
aws_s3_bucket.secure_storage: Refreshing state... [id=cyb611-secure-9r3207]
aws_iam_role_policy.scanner: Refreshing state... [id=S3ScannerRole:S3ScannerPolicy]
aws_lambda_function.scanner: Refreshing state... [id=S3SecurityScanner]
aws_iam_role_policy.attacker_policy: Refreshing state... [id=S3RedTeamRole:S3RedTeamPolicy]
aws_lambda_function.attacker_lambda: Refreshing state... [id=S3RedTeamScanner]
aws_s3_bucket_public_access_block.legacy_block: Refreshing state... [id=cyb611-insecure-no-encryption-dk8ofy]
aws_s3_bucket_versioning.legacy_versioning: Refreshing state... [id=cyb611-insecure-no-encryption-dk8ofy]
aws_s3_bucket_ownership_controls.legacy_ownership: Refreshing state... [id=cyb611-insecure-no-encryption-dk8ofy]
aws_s3_object.archive_file: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket_ownership_controls.public_log_ownership: Refreshing state... [id=cyb611-insecure-public-rw-logs-8p8ia2]
aws_s3_bucket_versioning.dev_versioning: Refreshing state... [id=cyb611-insecure-iam-84fojm]
aws_s3_bucket_ownership_controls.dev_ownership: Refreshing state... [id=cyb611-insecure-iam-84fojm]
aws_s3_bucket_public_access_block.dev_unsafe: Refreshing state... [id=cyb611-insecure-iam-84fojm]
aws_s3_bucket_ownership_controls.public_ownership: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2]
aws_s3_bucket_public_access_block.public_block: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2]
aws_s3_bucket_logging.public_logging_config: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2]
aws_s3_bucket_versioning.public_versioning: Refreshing state... [id=cyb611-insecure-public-rw-8p8ia2]
aws_s3_bucket_ownership_controls.ownership: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb]
aws_s3_bucket_cors_configuration.cors_config: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb]
aws_s3_bucket_versioning.versioning: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb]
aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb]
aws_s3_bucket_ownership_controls.legacy_log_ownership: Refreshing state... [id=cyb611-insecure-no-encryption-logs-dk8ofy]
aws_s3_bucket_acl.public_log_acl: Refreshing state... [id=cyb611-insecure-public-rw-logs-8p8ia2,log-delivery-write]
aws_cloudtrail.main_trail: Refreshing state... [id=arn:aws:cloudtrail:us-east-2:151462990345:trail/cyb611-management-events-trail]
aws_s3_bucket_policy.trail_bucket_policy: Refreshing state... [id=cyb611-cloudtrail-logs-phish-bits-12345]
aws_s3_bucket_policy.dev_policy: Refreshing state... [id=cyb611-insecure-iam-84fojm]
aws_lambda_function_url.scanner: Refreshing state... [id=S3SecurityScanner]
aws_lambda_function_url.attacker_url: Refreshing state... [id=S3RedTeamScanner]
aws_s3_bucket_acl.legacy_log_acl: Refreshing state... [id=cyb611-insecure-no-encryption-logs-dk8ofy,log-delivery-write]
aws_s3_object.web_asset: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket_policy.read_policy: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb]
aws_s3_bucket_acl.bucket_acl: Refreshing state... [id=cyb611-insecure-misconfigured-mpn9cb,public-read]
aws_s3_bucket_logging.legacy_logging_config: Refreshing state... [id=cyb611-insecure-no-encryption-dk8ofy]
aws_s3_bucket_ownership_controls.log_ownership: Refreshing state... [id=cyb611-secure-logs-9r3207]
aws_s3_object.dataset_upload: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket_server_side_encryption_configuration.default_enc: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_bucket_versioning.secure_versioning: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_object.sample_record: Refreshing state... [id=sensitive_data/mock_pii.csv]
aws_s3_bucket_ownership_controls.secure_ownership: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_bucket_policy.enforce_ssl: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_bucket_public_access_block.block_public: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_bucket_logging.log_config: Refreshing state... [id=cyb611-secure-9r3207]
aws_s3_bucket_acl.log_acl: Refreshing state... [id=cyb611-secure-logs-9r3207,log-delivery-write]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_s3_bucket.dev_logs will be destroyed
  # (because aws_s3_bucket.dev_logs is not in configuration)
  - resource "aws_s3_bucket" "dev_logs" {
      - arn                         = "arn:aws:s3:::cyb611-insecure-iam-logs-84fojm" -> null
      - bucket                      = "cyb611-insecure-iam-logs-84fojm" -> null
      - bucket_domain_name          = "cyb611-insecure-iam-logs-84fojm.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "cyb611-insecure-iam-logs-84fojm.s3.us-east-2.amazonaws.com" -> null
      - force_destroy               = true -> null
      - hosted_zone_id              = "Z2O1EMRO9K5GLX" -> null
      - id                          = "cyb611-insecure-iam-logs-84fojm" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-east-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
        # (3 unchanged attributes hidden)

      - grant {
            id          = null
          - permissions = [
              - "READ_ACP",
              - "WRITE",
            ] -> null
          - type        = "Group" -> null
          - uri         = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
        }
      - grant {
          - id          = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_acl.dev_acl will be created
  + resource "aws_s3_bucket_acl" "dev_acl" {
      + acl    = "private"
      + bucket = "cyb611-insecure-iam-84fojm"
      + id     = (known after apply)

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_acl.dev_log_acl will be destroyed
  # (because aws_s3_bucket_acl.dev_log_acl is not in configuration)
  - resource "aws_s3_bucket_acl" "dev_log_acl" {
      - acl                   = "log-delivery-write" -> null
      - bucket                = "cyb611-insecure-iam-logs-84fojm" -> null
      - id                    = "cyb611-insecure-iam-logs-84fojm,log-delivery-write" -> null
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "READ_ACP" -> null

              - grantee {
                    id            = null
                  - type          = "Group" -> null
                  - uri           = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - grant {
              - permission = "WRITE" -> null

              - grantee {
                    id            = null
                  - type          = "Group" -> null
                  - uri           = "http://acs.amazonaws.com/groups/s3/LogDelivery" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_acl.public_acl will be destroyed
  # (because aws_s3_bucket_acl.public_acl is not in configuration)
  - resource "aws_s3_bucket_acl" "public_acl" {
      - acl                   = "public-read" -> null
      - bucket                = "cyb611-insecure-public-rw-8p8ia2" -> null
      - id                    = "cyb611-insecure-public-rw-8p8ia2,public-read" -> null
        # (1 unchanged attribute hidden)

      - access_control_policy {
          - grant {
              - permission = "READ" -> null

              - grantee {
                    id            = null
                  - type          = "Group" -> null
                  - uri           = "http://acs.amazonaws.com/groups/global/AllUsers" -> null
                    # (2 unchanged attributes hidden)
                }
            }
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "0f0243f6e46bda888422b63fa362aae67555594febccc1b35c7d2751eb32aaab" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_logging.dev_logging will be destroyed
  # (because aws_s3_bucket_logging.dev_logging is not in configuration)
  - resource "aws_s3_bucket_logging" "dev_logging" {
      - bucket                = "cyb611-insecure-iam-84fojm" -> null
      - id                    = "cyb611-insecure-iam-84fojm" -> null
      - target_bucket         = "cyb611-insecure-iam-logs-84fojm" -> null
      - target_prefix         = "log/" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_ownership_controls.dev_log_ownership will be destroyed
  # (because aws_s3_bucket_ownership_controls.dev_log_ownership is not in configuration)
  - resource "aws_s3_bucket_ownership_controls" "dev_log_ownership" {
      - bucket = "cyb611-insecure-iam-logs-84fojm" -> null
      - id     = "cyb611-insecure-iam-logs-84fojm" -> null

      - rule {
          - object_ownership = "BucketOwnerPreferred" -> null
        }
    }

  # aws_s3_bucket_ownership_controls.dev_ownership will be updated in-place
  ~ resource "aws_s3_bucket_ownership_controls" "dev_ownership" {
        id     = "cyb611-insecure-iam-84fojm"
        # (1 unchanged attribute hidden)

      ~ rule {
          ~ object_ownership = "BucketOwnerEnforced" -> "BucketOwnerPreferred"
        }
    }

  # aws_s3_bucket_ownership_controls.public_ownership will be updated in-place
  ~ resource "aws_s3_bucket_ownership_controls" "public_ownership" {
        id     = "cyb611-insecure-public-rw-8p8ia2"
        # (1 unchanged attribute hidden)

      ~ rule {
          ~ object_ownership = "BucketOwnerPreferred" -> "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_policy.dev_policy will be updated in-place
  ~ resource "aws_s3_bucket_policy" "dev_policy" {
        id     = "cyb611-insecure-iam-84fojm"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      - Sid       = "InsecureWildcard"
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket_policy.enforce_tls_public will be created
  + resource "aws_s3_bucket_policy" "enforce_tls_public" {
      + bucket = "cyb611-insecure-public-rw-8p8ia2"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = [
                          + "arn:aws:s3:::cyb611-insecure-public-rw-8p8ia2",
                          + "arn:aws:s3:::cyb611-insecure-public-rw-8p8ia2/*",
                        ]
                      + Sid       = "DenyInsecureTransport"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_s3_bucket_policy.legacy_ssl_policy will be destroyed
  # (because aws_s3_bucket_policy.legacy_ssl_policy is not in configuration)
  - resource "aws_s3_bucket_policy" "legacy_ssl_policy" {
      - bucket = "cyb611-insecure-no-encryption-dk8ofy" -> null
      - id     = "cyb611-insecure-no-encryption-dk8ofy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::cyb611-insecure-no-encryption-dk8ofy",
                          - "arn:aws:s3:::cyb611-insecure-no-encryption-dk8ofy/*",
                        ]
                      - Sid       = "DenyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # aws_s3_bucket_policy.public_rw_policy will be created
  + resource "aws_s3_bucket_policy" "public_rw_policy" {
      + bucket = "cyb611-insecure-public-rw-8p8ia2"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:PutObjectAcl",
                        ]
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::cyb611-insecure-public-rw-8p8ia2/*"
                      + Sid       = "PublicReadWrite"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # aws_s3_bucket_public_access_block.dev_unsafe will be updated in-place
  ~ resource "aws_s3_bucket_public_access_block" "dev_unsafe" {
      ~ block_public_acls       = true -> false
        id                      = "cyb611-insecure-iam-84fojm"
      ~ ignore_public_acls      = true -> false
        # (3 unchanged attributes hidden)
    }

  # aws_s3_bucket_public_access_block.log_block will be created
  + resource "aws_s3_bucket_public_access_block" "log_block" {
      + block_public_acls       = false
      + block_public_policy     = true
      + bucket                  = "cyb611-insecure-no-encryption-logs-dk8ofy"
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.dev_enc will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.dev_enc is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "dev_enc" {
      - bucket                = "cyb611-insecure-iam-84fojm" -> null
      - id                    = "cyb611-insecure-iam-84fojm" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.legacy_enc will be destroyed
  # (because aws_s3_bucket_server_side_encryption_configuration.legacy_enc is not in configuration)
  - resource "aws_s3_bucket_server_side_encryption_configuration" "legacy_enc" {
      - bucket                = "cyb611-insecure-no-encryption-dk8ofy" -> null
      - id                    = "cyb611-insecure-no-encryption-dk8ofy" -> null
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm     = "AES256" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_server_side_encryption_configuration.public_enc will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "public_enc" {
      + bucket = "cyb611-insecure-public-rw-8p8ia2"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_object.iam_config will be destroyed
  # (because aws_s3_object.iam_config is not in configuration)
  - resource "aws_s3_object" "iam_config" {
      - arn                           = "arn:aws:s3:::cyb611-insecure-iam-84fojm/sensitive_data/mock_pii.csv" -> null
      - bucket                        = "cyb611-insecure-iam-84fojm" -> null
      - bucket_key_enabled            = false -> null
      - content                       = <<-EOT
            id,secret
            1,DevData
        EOT -> null
      - content_type                  = "text/csv" -> null
      - etag                          = "1fcc855d90d2824f99e15fff189456cd" -> null
      - force_destroy                 = false -> null
      - id                            = "sensitive_data/mock_pii.csv" -> null
      - key                           = "sensitive_data/mock_pii.csv" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "null" -> null
        # (13 unchanged attributes hidden)
    }

  # aws_s3_object.initial_config will be created
  + resource "aws_s3_object" "initial_config" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "cyb611-insecure-iam-84fojm"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = <<-EOT
            id,secret
            1,DevData
        EOT
      + content_type           = "text/csv"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "sensitive_data/mock_pii.csv"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 6 to add, 4 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```